// //
// // - Створити клас або функцію конструктор, за допомоги якої можна створювати об'єкти наступного вигляду.
// // Конструктор повинен приймати значення для кожної властивості, в т.ч і для властивостей внутрішніх об'єктів
// //
// // {
// //     id: 1,
// //     name: 'Leanne Graham',
// //     username: 'Bret',
// //     email: 'Sincere@april.biz',
// //     address: {
// //     street: 'Kulas Light',
// //         suite: 'Apt. 556',
// //         city: 'Gwenborough',
// //         zipcode: '92998-3874',
// //         geo: {
// //         lat: '-37.3159',
// //          lng: '81.1496'
// //     }
// // },
// //     phone: '1-770-736-8031 x56442',
// //     website: 'hildegard.org',
// //     company: {
// //     name: 'Romaguera-Crona',
// //         catchPhrase: 'Multi-layered client-server neural-net',
// //         bs: 'harness real-time e-markets'
// // }
// // }
// //
//
// class User {
//
//     constructor(id, name, username, email, street, suite, city, zipcode,
//                 lat, lng, phone, website, companyName, catchPhrase, bs) {
//         this.id = id;
//         this.name = name;
//         this.username = username;
//         this.email = email;
//         this.address = {
//             street: street,
//             suite: suite,
//             city: city,
//             zipcode: zipcode,
//             geo: {
//                 lat: lat,
//                 lng: lng
//             }
//         }
//         this.phone = phone;
//         this.website = website;
//         this.company = {
//             name: companyName,
//             catchPhrase: catchPhrase,
//             bs: bs,
//         }
//     }
// }
//
// let user = new User(1, 'Leanne Graham', 'Bret', 'Sincere@april.biz', 'Kulas Light',
//     'Apt. 556', 'Gwenborough', '92998-3874', '-37.3159', '81.1496',
//     '1-770-736-8031 x56442', 'hildegard.org', 'Romaguera-Crona',
//     'Multi-layered client-server neural-net', 'harness real-time e-markets'
// );
// console.log(user);
//
//
// //
// // -  Створити функцію конструктор / клас  який описує об'єкт тегу
// // Поля :
// //     -назва тегу ()
// // - опис його дій
// // - масив з атрибутами (2-3 атрибути максимум)
// // Кожен атрибут описати як окремий який буде містити
// // -назву атрибуту
// // -опис дії атрибуту
// // інформацію брати з htmlbook.ru
// //
// // Таким чином описати теги
// // -a
// // -div
// // -h1
// // -span
// // -input
// // -form
// // -option
// // -select
// // Приклад результуючого об'єкту
// // {
// //     titleOfTag: 'area',
// //         action: `Каждый элемент <area> определяет активные области изображения, которые являются ссылками...`,
// //     attrs: [
// //     {titleOfAttr: 'accesskey', actionOfAttr: 'Переход к области с помощью комбинации клавиш'},
// //     {/*some props and values*/},
// //     {/*...*/},
// //     {/*...*/},
// // ]
// //
// // }
//
// class TagObject {
//     constructor(titleOfTag, action, attrs) {
//         this.titleOfTag = titleOfTag;
//         this.action = action;
//         this.attrs = attrs;
//     }
// }
//
// class TagAttrs {
//     constructor(titleOfAttr, actionOfAttr) {
//         this.titleOfAttr = titleOfAttr;
//         this.actionOfAttr = actionOfAttr;
//     }
// }
//
// let tag_a = [
//     new TagAttrs('shape', 'Задает форму активной области ссылки для изображений.'),
//     new TagAttrs('title', 'Добавляет всплывающую подсказку к тексту ссылки.'),
//     new TagAttrs('href', 'Задает адрес документа, на который следует перейти.'),
// ];
// let tagObject_a = new TagObject('<a>', 'Тег <a> является одним из важных элементов HTML и предназначен ' +
//     'для создания ссылок. В зависимости от присутствия атрибутов name или href тег <a> устанавливает' +
//     ' ссылку или якорь. Якорем называется закладка внутри страницы, которую можно указать в качестве ' +
//     'цели ссылки. При использовании ссылки, которая указывает на якорь, происходит переход к закладке ' +
//     'внутри веб-страницы.\n' +
//     'Для создания ссылки необходимо сообщить браузеру, что является ссылкой, а также указать адрес' +
//     ' документа, на который следует сделать ссылку. В качестве значения атрибута href используется' +
//     ' адрес документа (URL, Universal Resource Locator, универсальный указатель ресурсов), на который' +
//     ' происходит переход. Адрес ссылки может быть абсолютным и относительным. Абсолютные адреса работают' +
//     ' везде и всюду независимо от имени сайта или веб-страницы, где прописана ссылка. Относительные ссылки, ' +
//     'как следует из их названия, построены относительно текущего документа или корня сайта.', tag_a);
// console.log(tagObject_a);
//
// let tag_div = [
//     new TagAttrs('align','Задает выравнивание содержимого тега <div>.'),
//     new TagAttrs('title','Добавляет всплывающую подсказку к содержимому.'),
// ];
// let tagObject_div = new TagObject('<div>', 'Элемент <div> является блочным элементом и предназначен для выделения фрагмента документа с целью изменения вида содержимого. Как правило, вид блока управляется с помощью стилей. Чтобы не описывать каждый раз стиль внутри тега, можно выделить стиль во внешнюю таблицу стилей, а для тега добавить атрибут class или id с именем селектора.\n' +
//     '\n' +
//     'Как и при использовании других блочных элементов, содержимое тега <div> всегда начинается с новой строки. После него также добавляется перенос строки.',
//     tag_div);
// console.log(tagObject_div);
//
// let tag_h1 = [
//     new TagAttrs('align','Определяет выравнивание заголовка.'),
// ];
// let tagObject_h1 = new TagObject('<h1>','HTML предлагает шесть заголовков разного уровня, которые показывают относительную важность секции, расположенной после заголовка. Так, тег <h1> представляет собой наиболее важный заголовок первого уровня, а тег <h6> служит для обозначения заголовка шестого уровня и является наименее значительным. По умолчанию, заголовок первого уровня отображается самым крупным шрифтом жирного начертания, заголовки последующего уровня по размеру меньше. Теги <h1>,...,<h6> относятся к блочным элементам, они всегда начинаются с новой строки, а после них другие элементы отображаются на следующей строке. Кроме того, перед заголовком и после него добавляется пустое пространство.',
//     tag_h1);
// console.log(tagObject_h1);
//
// let tag_span = [
//     new TagAttrs('class','Определяет имя класса, которое позволяет связать тег со стилевым оформлением.'),
//     new TagAttrs('hidden','Скрывает содержимое элемента от просмотра.'),
//     new TagAttrs('contenteditable','Сообщает, что элемент доступен для редактирования пользователем.'),
// ];
// let tagObject_span = new TagObject('<span>','Тег <span> предназначен для определения строчных элементов документа. В отличие от блочных элементов, таких как <table>, <p> или <div>, с помощью тега <span> можно выделить часть информации внутри других тегов и установить для нее свой стиль. Например, внутри абзаца (тега <p>) можно изменить цвет и размер первой буквы, если добавить начальный и конечный тег <span> и определить для него стиль текста. Чтобы не описывать каждый раз стиль внутри тега, можно выделить стиль во внешнюю таблицу стилей, а для тега добавить атрибут class или id с именем селектора.',
//     tag_span);
// console.log(tagObject_span);
//
// let tag_input = [
//     new TagAttrs('checked','Предварительно активированный переключатель или флажок.'),
//     new TagAttrs('disabled','Блокирует доступ и изменение элемента.'),
//     new TagAttrs('list','Указывает на список вариантов, которые можно выбирать при вводе текста.'),
// ];
// let tagObject_input = new TagObject('<input>', 'Тег <input> является одним из разносторонних элементов формы и позволяет создавать разные элементы интерфейса и обеспечить взаимодействие с пользователем. Главным образом <input> предназначен для создания текстовых полей, различных кнопок, переключателей и флажков. Хотя элемент <input> не требуется помещать внутрь контейнера <form>, определяющего форму, но если введенные пользователем данные должны быть отправлены на сервер, где их обрабатывает серверная программа, то указывать <form> обязательно. То же самое обстоит и в случае обработки данных с помощью клиентских приложений, например, скриптов на языке JavaScript.\n' +
//     '\n' +
//     'Основной атрибут тега <input>, определяющий вид элемента — type. Он позволяет задавать следующие элементы формы: текстовое поле (text), поле с паролем (password), переключатель (radio), флажок (checkbox), скрытое поле (hidden), кнопка (button), кнопка для отправки формы (submit), кнопка для очистки формы (reset), поле для отправки файла (file) и кнопка с изображением (image). Для каждого элемента существует свой список атрибутов, которые определяют его вид и характеристики. Кроме того, в HTML5 добавлено еще более десятка новых элементов.',
//     tag_input);
// console.log(tagObject_input);
//
// let tag_form = [
//     new TagAttrs('accept-charset','Устанавливает кодировку, в которой сервер может принимать и обрабатывать данные.'),
//     new TagAttrs('action','Адрес программы или документа, который обрабатывает данные формы.'),
// ];
// let tagObject_form = new TagObject('<form>', 'Тег <form> устанавливает форму на веб-странице. Форма предназначена для обмена данными между пользователем и сервером. Область применения форм не ограничена отправкой данных на сервер, с помощью клиентских скриптов можно получить доступ к любому элементу формы, изменять его и применять по своему усмотрению.\n' +
//     '\n' +
//     'Документ может содержать любое количество форм, но одновременно на сервер может быть отправлена только одна форма. По этой причине данные форм должны быть независимы друг от друга.\n' +
//     '\n' +
//     'Для отправки формы на сервер используется кнопка Submit, того же можно добиться, если нажать клавишу Enter в пределах формы. Если кнопка Submit отсутствует в форме, клавиша Enter имитирует ее использование.\n' +
//     '\n' +
//     'Когда форма отправляется на сервер, управление данными передается программе, заданной атрибутом action тега <form>. Предварительно браузер подготавливает информацию в виде пары «имя=значение», где имя определяется атрибутом name тега <input>, а значение введено пользователем или установлено в поле формы по умолчанию.',
//     tag_form);
// console.log(tagObject_form);
//
// let tag_option = [
//     new TagAttrs('value', 'Значение пункта списка, которое будет отправлено на сервер или прочитано с помощью скриптов.'),
//     new TagAttrs('selected', 'Заранее устанавливает определенный пункт списка выделенным.'),
// ];
// let tagObject_option = new TagObject('<option>', 'Тег <option> определяет отдельные пункты списка, создаваемого с помощью контейнера <select>. Ширина списка определяется самым широким текстом, указанным в теге <option>, а также может изменяться с помощью стилей. Если планируется отправлять данные списка на сервер, то требуется поместить элемент <select> внутрь формы. Это также необходимо, когда к данным списка идет обращение через скрипты.',
//     tag_option);
// console.log(tagObject_option);
//
// let tag_select = [
//     new TagAttrs('required', 'Список обязателен для выбора перед отправкой формы.'),
//     new TagAttrs('form', 'Связывает список с формой.'),
// ];
// let tagObject_select = new TagObject('<select>', 'Тег <select> позволяет создать элемент интерфейса в виде раскрывающегося списка, а также список с одним или множественным выбором, как показано далее. Конечный вид зависит от использования атрибута size тега <select>, который устанавливает высоту списка. Ширина списка определяется самым широким текстом, указанным в теге <option>, а также может изменяться с помощью стилей. Каждый пункт создается с помощью тега <option>, который должен быть вложен в контейнер <select>. Если планируется отправлять данные списка на сервер, то требуется поместить элемент <select> внутрь формы. Это также необходимо, когда к данным списка идет обращение через скрипты.',
//     tag_select);
// console.log(tagObject_select);
//
//
//
